{
  "status": "OK",
  "data": {
    "id": "11920832",
    "authors": [
      "Janssen, Michel"
    ],
    "citations": [
      {
        "raw": "Dorling, Jon. “Did Einstein Need General Relativity to Solve the Problem of Absolute Space? Or Had the Problem Already Been Solved by Special Relativity?” British Journal for the Philosophy of Science 29 (1978): 311–323. Earman, John. World Enough and Space-Time. Absolute versus Relational Theories of Space and Time.",
        "title": "Did Einstein Need General Relativity to Solve the Problem of Absolute Space? Or Had the Problem Already Been Solved by Special Relativity?”",
        "date": "1978",
        "doi": "10.1093/bjps/29.4.311"
      },
      {
        "raw": "Stachel, John, ed. Einstein’s Miraculous Year: Five Papers that Changed the Face of Physics. Princeton: Princeton University Press, 1998.",
        "title": "Einstein’s Miraculous Year: Five Papers that Changed the Face of Physics.",
        "date": "1998",
        "doi": "10.1119/1.19289"
      },
      {
        "raw": "Norton, John. “Geometries in Collision: Einstein, Klein, and Riemann.” In The Symbolic Universe. Geometry and Physics 1890–1930. Edited by Jeremy Gray. Oxford: Oxford University Press, 1999.",
        "title": "Geometries in Collision: Einstein, Klein, and Riemann.”",
        "date": "1999"
      },
      {
        "raw": "Einstein, Albert. Ideas and Opinions. New York: Crown Publishers, 1954.",
        "title": "Ideas and Opinions.",
        "date": "1954",
        "doi": "10.1007/bf02837912"
      },
      {
        "raw": "Janssen, Michel. “Reconsidering a Scientific Revolution: The Case of Einstein versus Lorentz.” Physics in Perspective 4 (2002): 421–446.",
        "title": "Reconsidering a Scientific Revolution: The Case of Einstein versus",
        "date": "2002",
        "doi": "10.1007/s000160200003"
      },
      {
        "raw": "———. Sidelights on Relativity. New York: Dover, 1983.",
        "title": "Sidelights on Relativity.",
        "date": "1983",
        "doi": "10.1038/112319a0"
      },
      {
        "raw": "———. “COI Stories: Explanation and Evidence in the History of Science.” Perspectives on Science 10 (2002): 457–522. Janssen, Michel, and John Stachel. “Optics and Electrodynamics in Moving Bodies.” In Going Critical. John Stachel. Dordrecht: Kluwer, in preparation.",
        "title": "Stories: Explanation and Evidence in the History of",
        "date": "2002",
        "doi": "10.1162/106361402322288066"
      },
      {
        "raw": "Pais, Abraham . ‘Subtle is the Lord…’: The Science and the Life of Albert Einstein. Oxford: Oxford University Press, 1982. Renn, Jürgen, et al. The Genesis of General Relativity: Documents and Interpretation. Vol. 1. General Relativity in the Making: Einstein’s Zurich Notebook. 2 Volumes. Dordrecht: Kluwer, in preparation.",
        "title": "Subtle is the Lord…’: The Science and the Life of Albert Einstein.",
        "date": "1982",
        "doi": "10.2307/3104242"
      },
      {
        "raw": "Rynasiewicz, Robert. “The Construction of the Special Theory: Some Queries and Considerations.” In Einstein: The Formative Years, 1879-1909. Edited by Don Howard and John Stachel. Boston: Birkhäuser, 2000.",
        "title": "The Construction of the Special Theory: Some Queries and Considerations.” In Einstein: The Formative Years, 1879-1909. Edited by Don Howard and John Stachel.",
        "date": "2000",
        "doi": "10.1007/978-1-4612-0311-7_6"
      },
      {
        "raw": "Alexander, H. G., ed. The Leibniz-Clarke Correspondence. Manchester: Manchester University Press, 1956.",
        "title": "The Leibniz-Clarke Correspondence. Manchester:",
        "date": "1956",
        "doi": "10.1017/s0031819100052001"
      },
      {
        "raw": "———. The Meaning of Relativity. Princeton: Princeton University Press, 1956.",
        "title": "The Meaning of Relativity.",
        "date": "1956",
        "doi": "10.1016/0029-5582(56)90077-3"
      },
      {
        "raw": "Einstein, Albert, et al. The Principle of Relativity. New York: Dover, 1952.21 Goenner, Hubert, et al., eds. The Expanding Worlds of General Relativity. Boston: Birkhäuser, 1999.",
        "title": "The Principle of Relativity.",
        "date": "1952",
        "doi": "10.4324/9780203449530"
      },
      {
        "raw": "Niven, W. D., ed. The Scientific Papers of James Clerk Maxwell. 2 Volumes. Cambridge: Cambridge University Press, 1890.",
        "title": "The Scientific Papers of James Clerk Maxwell. 2 Volumes. Cambridge:",
        "doi": "10.1017/cbo9780511698095"
      },
      {
        "raw": "———. Relativity. The Special and the General Theory. New York: Bonanza, 1961.",
        "title": "The Special and the General Theory.",
        "date": "1961",
        "doi": "10.4324/9780203198711"
      }
    ],
    "contributors": [],
    "datePublished": "2004-04",
    "description": "A brief review (~8K words) of the history and philosophy of special and general relativity for a Dictionary of the History of Idea",
    "fullText": "1Relativity1\nMichel Janssen\nThe first thing to note about the theory of relativity is that there are two different theories\nof relativity, the special theory put forward in Albert Einstein’s famous 1905 paper, “On\nthe Electrodynamics of Moving Bodies,” and the general theory, completed in November\n1915 and first presented systematically in a review article published in March 1916.\nSpecial relativity extends the principle of relativity for uniform motion, known in\nmechanics since the days of Galileo, to all of physics, in particular to electrodynamics,\nthe field out of which the theory grew. Although the key contribution was Einstein’s,\nseveral other scientists deserve credit for it as well, most importantly the Dutch physicist\nH. A. Lorentz, the French mathematician Henri Poincaré, and the German mathematician\nHermann Minkowski. General relativity, by contrast, was essentially the work of one\nman. It was the crowning achievement of Einstein’s scientific career. Its name, however,\nis something of a misnomer. The theory does not extend the principle of relativity for\nuniform motion to non-uniform motion. It retains the notion of absolute\nacceleration—i.e., acceleration with respect to space-time rather than with respect to\nother bodies. In this sense, general relativity is no different from Newtonian theory or\nspecial relativity. Absolute acceleration, however, is much more palatable in general\nrelativity than in these earlier theories.\nFrom the point of view of modern physics, the question to what extent general\nrelativity fulfilled Einstein’s original hopes of relativizing all motion is of secondary\nimportance. What matters most is that general relativity is a powerful new theory of\ngravity, based on the insight, called the equivalence principle, that the effects of gravity\nand those of acceleration ought to be described by one and the same structure, curved\nspace-time.\n                                                 \n1\n To appear in: Maryanne Cline Horowitz et al., eds. Dictionary of the History of Ideas. New York: Charles\nScribner's Sons. In preparation.\n2Special Relativity\nSpecial relativity grew out of problems in electrodynamics. In 1862 James Clerk\nMaxwell first published the set of equations named after him, providing a comprehensive\ndescription of all electric and magnetic phenomena that had been studied up to that point.\nHe also made a new prediction. The equations allow electromagnetic waves propagating\nat the speed of light. Maxwell famously concluded: “light consists of the transverse\nundulations of the same medium which is the cause of electric and magnetic phenomena”\n(Niven, I, 500).\nAs the quotation above illustrates, it was taken for granted in the 19th century that\nboth light waves and electric and magnetic fields need a medium to support them. This\nmedium, which was thought to fill the entire universe, was called the luminiferous (=\nlight carrying) ether. Most physicists believed that it was completely immobile (for\ndiscussion of the reasons for this belief, see Janssen and Stachel). Ordinary matter, they\nthought, would move through the ether without disturbing it in the least. The earth, for\ninstance, would zip through the ether at a velocity in the order of 30 km/s, the velocity of\nthe earth’s motion around the sun. On earth there should therefore be a brisk ether wind\nblowing in the opposite direction. This ether drift, as it was called, could not be felt\ndirectly, but ever since the resurgence of the wave theory of light at the beginning of the\n19th century, attempts had been made to detect its influence on light from terrestrial and\ncelestial sources. To be sure, such effects were expected to be small. The velocity of\nlight, after all, is ten thousand times greater than the earth’s velocity in its orbit around\nthe sun. Yet optical experiments were accurate enough to detect such effects. All attempts\nto detect the elusive ether drift, however, failed, and optical theory had to be adjusted to\naccount for these failures.\nThe combination of Maxwell’s theory and the concept of an immobile ether likewise\nfaced the problem of how to explain the absence of any detectable ether drift. When\nMaxwell found that his equations predict electromagnetic waves propagating with the\nvelocity of light, he quite naturally assumed that this would be their velocity with respect\nto the ether. As long as one accepts classical kinematics, as everyone before Einstein\ntacitly did, it trivially follows that their velocity with respect to an observer on earth is\n3the vector sum of the velocity of propagation in the ether and the velocity of the ether\ndrift on earth. This, in turn, meant that Maxwell’s equations could only hold in a frame of\nreference at rest in the ether: in a moving frame, electromagnetic waves would have\ndifferent velocities in different directions. The frame of reference of the earth is such a\nmoving frame. We are thus driven to the conclusion that Maxwell’s equations do not hold\nin the frame in and for which they were discovered! Experiments with electricity and\nmagnetism were not accurate enough to detect any possible deviations from Maxwell’s\nequations, but experiments in optics were. The failure of such experiments to detect ether\ndrift thus posed a problem for the theory.\nIn the 1890s Lorentz set out to explain the absence of any signs of ether drift on the\nbasis of Maxwell’s theory. Using classical kinematics, Lorentz first determined the laws\nthat electric and magnetic fields obey in a frame moving through the ether given that they\nobey Maxwell’s equations in a frame at rest in the ether. He then replaced the\ncomponents ( Ex , …, Bx , …) of the real electric and magnetic fields E and B by the\ncomponents ( ′Ex , …, ′Bx , …) of the auxiliary and, as far as Lorentz was concerned,\npurely fictitious fields ′E  and ′B . The components of these auxiliary fields mix\ncomponents of the real electric and magnetic fields (e.g., in a frame moving with velocity\nv in the x-direction, ′ ≈ −E E vBy y z ). He did the same with the space and time coordinates.\nIn particular, he replaced the real time t by a fictitious variable ′t , which he gave the\nsuggestive name ‘local time’ because it depends on position (in a frame moving with\nvelocity v in the x-direction, ′ ≈ −t t v c x( / )2 ). Lorentz chose these quantities in such a\nway that in any frame moving through the ether with some constant velocity v, the\nfictitious fields ′E  and ′B  as functions of the fictitious variables ′ ′( )x ,t  satisfy\nMaxwell’s equations, just as the real fields as functions of the real space and time\nvariables in a frame at rest in the ether. Maxwell’s equations, in other words, are invariant\nunder the transformation from the real fields E and B as functions of the space and time\ncoordinates in a frame at rest in the ether to the fictitious fields ′E  and ′B  as functions of\nthe fictitious space and time coordinates of a moving frame. This is the essence of what\nLorentz called the theorem of corresponding states (Janssen 2002, 424). The\n4transformation is an example of what are now called Lorentz transformations. Maxwell’s\nequations are invariant under Lorentz transformations— or Lorentz invariant for short.\nWith the help of this mathematical result, Lorentz was able to show in 1895 that, to\nfirst order in the small quantity v c/ ≈ −10 4, many phenomena on earth or in any other\nframe moving through the ether will be indistinguishable from the corresponding\nphenomena in a frame at rest in the ether. In particular, he could show that, at least to this\ndegree of accuracy, motion through the ether would not affect the pattern of light and\nshadow obtained in any optical experiment. Since the vast majority of optical\nexperiments eventually boil down to the observation of such patterns, this was a very\npowerful result.\nIn 1899—and more systematically in 1904 (Einstein et al., 1954, 9–34)—Lorentz\nextended his analysis to higher powers of v c/ . He now found that there is a tiny\ndifference between the pattern of light and shadow obtained in an experiment performed\nwhile moving through the ether and the pattern of light and shadow obtained in the\ncorresponding experiment performed at rest in the ether. Compared to the latter, the\nformer pattern is contracted by a factor 1 2 2− v c/  in the direction of motion. Lorentz\nhad come across this contraction factor before. In 1887, the American scientists Albert A.\nMichelson and Edward W. Morley had tried to detect ether drift in an experiment\naccurate to order v c/( )2 . They had not found any. Independently of one another (in 1889\nand 1892, respectively), the Irish physicist George Francis FitzGerald and Lorentz had\nsuggested that this negative result could be accounted for by assuming that material\nbodies, such as the optical components in the experiment, contract by a factor\n1 2 2− v c/  in the direction of motion. Lorentz’s analysis of 1899 and 1904 showed that\nthis contraction hypothesis, as it came to be known, could be used not just to explain why\nthe Michelson-Morley experiment had not detected any ether drift but to explain much\nmore generally why no observation of patterns of light and shadow ever would.\nIn modern terms, the hypothesis that Lorentz added to his theory in 1899 is that the\nlaws governing matter, like Maxwell’s equations, are Lorentz invariant. To this end,\nLorentz had to amend the Newtonian laws that had jurisdiction over matter in his theory.\nAs he had shown in the case of Maxwell’s equations, it is a direct consequence of the\n5Lorentz invariance of the laws governing a physical system that the system will undergo\nthe Lorentz-FitzGerald contraction when moving with respect to the ether. From a purely\nmathematical point of view, Lorentz had thereby arrived at special relativity. To meet the\ndemands of special relativity, all that needs to be done is to make sure that any proposed\nphysical law is Lorentz invariant. Conceptually, however, Lorentz’s theory is very\ndifferent from Einstein’s. In Einstein’s theory, the Lorentz invariance of all physical laws\nreflects a new space-time structure. Lorentz retained Newton’s conception of space and\ntime, the structure of which is reflected in the invariance of the laws of Newtonian\nphysics under what are now called Galilean transformations. It is an unexplained\ncoincidence in Lorentz’s theory that all laws are invariant under Lorentz transformations,\nwhich have nothing to do with the Newtonian space-time structure posited by the theory.\nThis mismatch between the Newtonian concepts of space and time (and the classical\nGalilean kinematics associated with it) and the Lorentz invariance of the laws governing\nmatter and fields in space-time manifests itself in many other ways. Einstein hit upon a\nparticular telling example of this kind and used it in the very first paragraph of his 1905\npaper. The example is illustrated in Figure 1.\nmagnet\nmagnet moving conductor moving\nwire\n(a) (b)\nv v\nFig. 1. Einstein’s magnet-conductor experiment.\nConsider a bar magnet and a conductor—a piece of wire hooked up to an\nammeter—moving with respect to one another at relative velocity v. In Lorentz’s theory\nwe need to distinguish two cases, (a) with the conductor and (b) with the magnet at rest in\nthe ether. In case (a) the approaching magnet causes the magnetic field at the location of\nthe wire to grow. According to Faraday’s law of induction, this change in magnetic field\n6induces an electric field, producing a current in the wire, which is registered by the\nammeter. In case (b) the magnetic field is not changing and there is no induced electric\nfield. The ammeter, however, still registers a current. This is because the electrons in the\nwire are moving in the magnetic field and experience a Lorentz force that makes them go\naround the wire. It turns out that the currents in cases (a) and (b) are exactly the same.\nYet, Lorentz’s theoretical account of what produces these currents is very different for\nthe two cases. We have here, in Einstein’s words, an example of theoretical “asymmetries\nthat do not appear to be inherent in the phenomena” (Einstein et al., 1954, 37). Einstein\nproposed to remove the asymmetry by insisting that cases (a) and (b) are just one and the\nsame situation looked at from different perspectives. Even though this meant that he had\nto jettison the ether, Einstein took the relativity principle for uniform motion from\nmechanics and applied it to this situation in electrodynamics. He then proposed to extend\nthe principle to all of physics.\nIn 1919, in an article intended for Nature but never actually submitted, Einstein\nexplained the importance of the example of the magnet and the conductor for the genesis\nof special relativity: “The idea that we would be dealing here with two fundamentally\ndifferent situations was unbearable to me […] The existence of the electric field was\ntherefore a relative one, dependent on the coordinate system used, and only the electric\nand magnetic field taken together could be ascribed some kind of objective reality. This\nphenomenon of electromagnetic induction forced me to postulate the […] relativity\nprinciple” (Stachel et al., Vol. 7, 264–265; Janssen 2002, 504). The lack of documentary\nevidence for the period leading up to his creative outburst in his miracle year 1905 makes\nit very hard to reconstruct Einstein’s path to special relativity (for a valiant attempt see\nRynasiewicz). It seems clear, however, that Einstein hit upon the idea of ‘the relativity of\nelectric and magnetic fields’ expressed in the quotation above before he hit upon the new\nideas about space and time for which special relativity is most famous. His reading of\nworks of Lorentz and Poincaré probably helped him connect the dots from one to the\nother.\nOnce again consider the example of the magnet and the conductor in Fig. 1. From the\npoint of view of the magnet (b), the electromagnetic field only has a magnetic\ncomponent. From the point of view of the conductor (a), this same field has both a\n7magnetic and an electric component. Lorentz’s work provides the mathematics needed to\ndescribe this state of affairs. Einstein came to recognize that the fictitious fields of\nLorentz’s theorem of corresponding states are in fact the fields measured by a moving\nobserver. (He also recognized that the roles of Lorentz’s two observers, one at rest and\none moving in the ether, are completely interchangeable.) If the observer at rest with\nrespect to the magnet measures a magnetic field with z-component Bz , then the observer\nat rest with respect to the conductor will not only measure a magnetic field but also an\nelectric field with y-component ′Ey. This is captured in Lorentz’s formula ′ ≈ −E E vBy y z\nfor one of the components of his fictitious fields.\nMaxwell’s theory is compatible with the relativity principle if it can be shown that the\nobserver measuring the Lorentz-transformed electric and magnetic fields ′E  and ′B  also\nmeasures the Lorentz-transformed space and time coordinates ′ ′( )x ,t . Carefully\nanalyzing how an observer moving through the ether would synchronize her clocks,\nPoincaré had already shown to first order in v c/  that such clocks register Lorentz’s local\ntime (Janssen, 428). A direct consequence of this is that observers in relative motion to\none another will disagree about whether two events occurring in different places\nhappened simultaneously or not. Distant simultaneity is not absolute but depends upon\nthe state of motion of the observer making the call. This insight made everything fall into\nplace for Einstein about six weeks before he published his famous 1905 paper.\nEinstein modeled the presentation of his theory on thermodynamics (as he explained,\nfor instance, in an article for The London Times in 1919; see Einstein 1954, 228). He\nstarted from two postulates, the analogues of the two laws of thermodynamics. The first\nis the relativity postulate, which extends the principle of the relativity of uniform motion\nfrom mechanics to all of physics; the other, known as the light postulate, is the key\nprediction that Einstein needed from electrodynamics to develop his theory: “light is\nalways propagated in empty space with a definite velocity c which is independent of the\nstate of motion of the emitting body” (Einstein et al., 1954, 37). The combination of these\ntwo postulates appears to lead to a contradiction: two observers in relative motion will\nboth claim that one and the same light beam has velocity c with respect to them! Einstein\nreassured the reader that the two postulates are “only apparently irreconcilable” (ibid.).\nReconciling the two, however, requires giving up several common-sense notions about\n8space and time and replacing them with unfamiliar new ones, such as the relativity of\nsimultaneity, length contraction (moving objects are shorter than identical objects at rest),\nand time dilation (processes in moving systems take longer than identical processes in\nsystems at rest). Einstein derived these effects from his two postulates and the plausible\nassumption that space and time are still homogeneous and isotropic in his new theory.\nFollowing Poincaré’s lead but without neglecting terms smaller than of order v c/ ,\nEinstein showed that the time and space coordinates of two observers in uniform relative\nmotion are related to one another through a Lorentz transformation. Einstein thus\nintroduced a new kinematics. In the second part of his paper, he showed that this new\nkinematics removes the incompatibility of Maxwell’s equations with the relativity\nprinciple. He did this simply by proving that Maxwell’s equations are Lorentz invariant.\nSince he was familiar with an early version of Lorentz’s theorem of corresponding states\n(valid to order v c/ ), he would have had no trouble with this proof.\nIn 1908, Minkowski supplied the geometry of the space-time to which Einstein’s new\nkinematics applies. The geometry of this Minkowski space-time is similar to Euclidean\ngeometry. Frames of reference in different states of motion resemble Cartesian coordinate\nsystems with different orientations of their axes. Lorentz transformations in Minkowski\nspace-time are akin to rotations in Euclidean space. The demand that physical laws be\nLorentz invariant thus acquired the same status as the demand that physical laws should\nbe independent of the orientation of the axes of the coordinate system used to formulate\nthem.\nIn a passage that echoes Einstein’s comments about electric and magnetic fields\nquoted above, Minkowski wrote: “space by itself, and time by itself, are doomed to fade\naway into mere shadows, and only a kind of union of the two will preserve an\nindependent reality” (Einstein et al., 1954, 73). Different observers in Minkowski space-\ntime will agree on the space-time distance between any two events, but disagree on how\nto break down that spatio-temporal distance into a spatial and a temporal component. It is\nthis disagreement that lies behind relativity of simultaneity, length contraction, and time\ndilation, the effects Einstein had derived from his two postulates (Janssen 2002,\n429–430). In light of this analysis, Minkowski pointed out, the phrase ‘relativity\npostulate’ seemed ill-chosen: “Since the postulate comes to mean that only the four-\n9dimensional world in space and time is given […] but that the projection in space and in\ntime may still be undertaken with a certain degree of freedom, I prefer to call it the\npostulate of the absolute world” (Einstein et al., 1954, 83).\nEinstein agreed with Minkowski on this point but felt that it was already too late to\nchange the theory’s name. Minkowski’s geometrical reformulation of the theory,\nhowever, initially met with resistance on Einstein’s part, who dismissed it as “superfluous\nlearnedness” (Pais, 152). He only came to value Minkowski’s contribution in his work on\ngeneral relativity.\nGeneral Relativity\nEinstein was not satisfied with special relativity for very long. He felt strongly that the\nprinciple of relativity for uniform motion ought to be generalized to arbitrary motion. In\nhis popular book on relativity of 1917 (Einstein 1961, 72, ch. 21), he used a charming\nanalogy to explain what he found so objectionable about absolute motion. Consider two\nidentical tea kettles sitting on a stove. One is giving off steam, but the other is not. You\nare puzzled by this until you see that the burner under the first kettle is turned on, but that\nthe burner under the second is not. Compare this situation to that of two identical globes\nrotating with respect to one another around the line connecting their centers (Einstein et\nal., 112–115, sec. 2). This situation, like that of the two tea kettles, at first seems to be\ncompletely symmetric. Observers on both globes will see the other globe rotating. Yet\none globe bulges out at the equator, while the other does not. What is responsible for this\ndifference? The Newtonian answer is: absolute space. What makes a globe bulge out is\nnot its rotation with respect to the other globe, but its rotation with respect to absolute\nspace. The special-relativistic answer is the same except that Newton’s absolute space\nneeds to be replaced by Minkowski’s absolute space-time. Einstein found this answer\nunsatisfactory, because neither Newton’s absolute space nor Minkowski’s absolute space-\ntime can be directly observed. And without an observable cause for the difference\nbetween the two globes, we would have a violation of Leibniz’s Principle of Sufficient\nReason. It would be as if the burners under both tea kettles were turned on, but only one\nof them gave off steam.\n10\nThere is a crucial difference, however, between the Newtonian and the special-\nrelativistic answer (Dorling). In special relativity, the situation of the two globes is not\neven symmetric at the kinematical level. Because of time dilation, one revolution of the\nother globe takes less time for an observer on the globe rotating in Minkowski space-time\nthan it does for an observer on the other one. It therefore need not surprise us that the\nsituation is not symmetric at the dynamical level either, i.e., that only one globe bulges\nout. In terms of Einstein’s analogy: if the two tea kettles do not look the same, it need not\nsurprise us that they do not behave the same. Absolute acceleration in special relativity\nthus does not violate the Principle of Sufficient Reason. Einstein failed to appreciate that\nspecial relativity had already solved what he himself identified as the problem of absolute\nmotion.\nEinstein set out on the road that would lead to general relativity in 1907. In the 1919\narticle quoted in the preceding section, he vividly recalls the initial flash of insight.\nImmediately following the passage quoted earlier, he writes: “Then came to me the best\nidea [die glücklichste Gedanke] of my life […] Like the electric field generated by\nelectromagnetic induction, the gravitational field only has a relative existence. Because,\nfor an observer freely falling from the roof of a house, no gravitational field exists while\nhe is falling. The experimental fact that the acceleration due to gravity does not depend\non the material is thus a powerful argument for extending the relativity postulate to\nsystems in non-uniform relative motion” (Pais, 178; Janssen 2002, 507).\nThis extended relativity postulate, it turns out, is highly problematic. What it boils\ndown to is that two observers accelerating with respect to one another can both claim to\nbe at rest if they agree to disagree about whether a gravitational field is present or not.\nThis curious principle is best illustrated with a couple of examples.\nFirst, consider the unfortunate observer falling from the roof in Einstein’s example.\nFor a fleeting moment this person will feel like a modern astronaut orbiting the earth in a\nspace-shuttle. Einstein, watching his observer accelerate downwards from the safety of\nhis room in the Berne Patent Office where he was working at the time, is at rest in the\ngravitational field of the earth. For the falling person, however, there seems to be no\ngravitational field. He can, if he wishes, maintain that he is at rest and that Einstein and\nthe Patent Office are accelerating upwards.\n11\nAs a second example, imagine two astronauts in rocket ships hovering side-by-side in\nsomewhere in outer space where the effects of gravity are negligible. One of the\nastronauts fires up the engines of her rocket ship. According to the other astronaut she\naccelerates, but she can, if she were so inclined, maintain that she is at rest in the\ngravitational field that suddenly came into being when her engines were switched on and\nthat the other rocket ship and its crew are in free fall in this gravitational field. Einstein\nproduced an account of the twin paradox along these lines as late as 1919 (Stachel et al.,\nVol. 7, Doc. 13).\nNotice that the ‘relativity of acceleration’ in these two examples is very different\nfrom the relativity of uniform motion in special relativity. Two observers in uniform\nrelative motion are physically fully equivalent to one another; two observers in non-\nuniform relative motion are not. This is clear in both examples. (1) Free fall in a\ngravitational field (a) feels different from resisting the pull of gravity (b). (2) Hovering in\nouter space (a) feels different from accelerating in outer space (b). In both cases, the\n‘relativity of acceleration’ is relativity in name only. In fact, the pair (1a)–(2a) and the\npair (1b)–(2b) feel the same.\nEinstein’s excitement about “the best idea of his life” was nonetheless fully justified.\nGalileo’s principle that all matter falls with the same acceleration in a given gravitational\nfield cries out for an explanation. Newton incorporated the principle by giving two very\ndifferent concepts of mass the same numerical value. He set inertial mass, a measure of a\nbody’s resistance to acceleration, equal to gravitational mass, a measure of a body’s\nsusceptibility to gravity. In Newton’s theory this is an unexplained coincidence. Einstein\ncorrectly surmised that this equality points to an intimate connection between\nacceleration and gravity. He called this connection the equivalence principle. It was not\nuntil after he finished his general theory of relativity, however, that he was able to\narticulate what exactly the connection is.\nThat did not stop him from relying heavily on the equivalence principle in\nconstructing his theory. Since accelerating in Minkowski space-time feels the same as\nresisting the pull of gravity, Einstein was able to glean some features of gravitational\nfields in general by studying acceleration in Minkowski space-time. In particular, he\nexamined the situation of an observer on a rotating disk or a merry-go-round in\n12\nMinkowski space-time. Appealing to the embryonic equivalence principle, the man on\nthe disk can claim to be at rest and attribute the centrifugal forces due to his centripetal\nacceleration to a centrifugal gravitational field. Suppose the man on the disk and a\nwoman standing next to it are both asked to determine the ratio of the disk’s\ncircumference to its radius. The woman will find 2π, the answer given by Euclidean\ngeometry. Because of length contraction, which affects the measuring rods placed along\nthe circumference but not the ones along the radius which move perpendicularly to their\nlength, the man on the disk will find a value greater than 2π. This means that the spatial\ngeometry for an observer rotating in Minkowski space-time is non-Euclidean. The\nequivalence principle says that the spatial geometry for an observer in a gravitational\nfield will then, in general, also be non-Euclidean. This simple consideration, in all\nlikelihood, gave Einstein the idea to represent gravity by the curvature of space-time\n(Howard and Stachel, 48–62).\nRecognizing that gravity is part of the fabric of space-time made it possible to give a\nmore precise formulation of the equivalence principle. The mature form of the\nequivalence principle is brought out very nicely by the analogy that Einstein sets up but\nnever quite finishes in the 1919 passage quoted above. Special relativity made it clear\nthat electric and magnetic fields are part of one entity, the electromagnetic field, which\nbreaks down differently into electric and magnetic components for different observers.\nGeneral relativity similarly made it clear that the inertial structure of space-time and the\ngravitational field are not two separate entities but components of one entity, now called\nthe inertio-gravitational field. Inertial structure determines the trajectories of free\nparticles. Gravity makes all particles deviate from these trajectories in identical fashion,\nregardless of their mass. These are the only marching orders that all particles have to\nobey. In general relativity, they are all issued by one and the same authority, the inertio-\ngravitational field, represented by curved space-time. Which marching orders are credited\nto inertial structure and which ones to gravity depends on the state of motion of the\nobserver. The connection between acceleration (or, equivalently, inertia) and gravity is\nthus one of unification rather than one of reduction, as with the nominal ‘relativity of\nacceleration’ discussed above in which acceleration was being reduced to gravity.\n13\nHow do the examples of non-uniform motion discussed above fit into the new scheme\nof things? Free fall in a gravitational field (1a) and hovering in outer space (2a) are both\nrepresented as motion along the straightest possible lines in what in general will be a\ncurved space-time. Such lines are called geodesics. Resisting the pull of gravity (1b) and\naccelerating in outer space (2b) are both represented as motion along crooked lines or\nnon-geodesics. Since no change of perspective will transform a geodesic into a non-\ngeodesic or vice versa, there is an absolute difference between (1a) and (1b) as well as\nbetween (2a) and (2b). Absolute acceleration survives in general relativity, as in special\nrelativity, in the guise of an absolute distinction between geodesic and non-geodesic\nmotion. This does not violate the Principle of Sufficient Reason since geodesics and non-\ngeodesics are already different at a purely kinematical or geometrical level.\nEinstein did not give up his crusade against absolute motion so easily. Once he had\nrealized that gravity is space-time curvature, he quickly came up with a new (though once\nagain flawed) strategy for extending the principle of relativity from uniform to arbitrary\nmotion. To describe curved space-time, Einstein had turned to the theory of curved\nsurfaces of the great 19th-century German mathematician Carl-Friedrich Gauss. To\ndescribe such surfaces (think of the surface of the earth for instance) one needs a map, a\ngrid that assigns unique coordinates to every point of the surface, and sets of numbers to\nconvert coordinate distances (i.e., distances on a map) to real distances (i.e., distance on\nthe actual surface). These sets of numbers are called the components of the metric tensor.\nIn general they are different for different points. The conversion from coordinate\ndistances to real distances is thus given by a field, called the metric field, which assigns\nthe appropriate metric tensor to every point.\nA simple example may help to better understand the concept of a metric tensor field.\nOn a standard map of the earth, countries close to the equator look smaller than countries\nclose to the poles. The conversion factors from coordinate distances to real distances are\ntherefore larger near the equator than they are near the poles. The metric tensor field thus\nvaries from point to point, just like an electromagnetic field. Furthermore, at one and the\nsame point, the conversion factor for north-south distances may differ from the\nconversion factor for east-west distances. The metric tensor at one point thus has different\ncomponents for different directions.\n14\nGauss’ theory of curved surfaces was generalized to spaces of higher dimension by\nanother German mathematician, Bernhard Riemann. This Riemannian geometry can\nhandle curved space-time as well. In the case of four-dimensional space(-time), the\nmetric tensor has ten independent components. In Einstein’s theory, the metric tensor\nfield does double duty: it describes both the geometry of space-time and the gravitational\nfield. Mass—or its equivalent, energy—is the source of gravitational fields. Which field\nis produced by a given source is determined by so-called field equations. To complete his\ntheory Einstein thus had to find field equations for the metric field.\nEinstein hoped to find field equations that would retain their form under arbitrary\ncoordinate transformations. This property is called general covariance. The description\nof curved space-time outlined in the preceding paragraph clearly is generally covariant.\nOne can choose any grid to assign coordinates to the points of space-time. Each choice\nwill come with its own sets of conversion factors. In other words, the metric field\nencoding the geometry of the space-time will be represented by different mathematical\nfunctions depending on which coordinates are used. Riemannian geometry is formulated\nin such a way that it works in arbitrary coordinates. It provides standard techniques for\ntransforming the metric field from one coordinate system to another. If only Einstein\ncould find field equations for the metric field that retain their form under arbitrary\ntransformations, his whole theory would be generally covariant. In special relativity,\nLorentz invariance expresses the relativity of uniform motion. Einstein—understandably\nperhaps but mistakenly—thought that extending Lorentz invariance to invariance under\narbitrary transformations would automatically extend the principle of relativity from\nuniform to arbitrary motion.\nThis line of thinking, however, conflates two completely different traditions in 19th-\ncentury geometry (Norton). Minkowski’s work with special relativity is in the tradition of\nprojective geometry, associated with the so-called Erlangen Program of Felix Klein.\nEinstein’s work with general relativity is in the tradition of differential geometry of\nGauss and Riemann. The approaches of Klein and Riemann can be characterized as\n‘subtractive’ and ‘additive’, respectively (Norton).\nIn the subtractive approach one starts from an exhaustive description of space-time\nwith all bells and whistles and then strips down this description to its bare essentials. The\n15\nrecipe for doing that is to assign reality only to elements that are invariant under the\ngroup of transformations that relate different perspectives on the space-time. This group\nof transformations is thus directly related to some relativity principle. The most famous\napplication of this strategy in physics is Minkowski’s geometrical formulation of special\nrelativity. The group of transformations in this case is the group of Lorentz\ntransformations.\nIn the additive approach one starts with the set of space-time points stripped of all\ntheir properties and then adds the minimum geometrical structure needed to define\nstraight(est) lines and distances in space-time. To guarantee that the added structure\ndescribes only intrinsic features of space-time, the demand is made that the description be\ngenerally covariant, i.e., that it does not depend on the coordinates used. This procedure\ncan obviously be applied to any space-time. Only in certain special cases, however, will\nthere be symmetries such as Lorentz invariance in Minkowski space-time reflecting the\nphysical equivalence of different frames of reference and thereby some relativity\nprinciple. In the generic case there will be no symmetries whatsoever  and hence no\nprinciple of relativity at all. This shows that general covariance has nothing to do with\ngeneral relativity. Comparing Lorentz invariance in special relativity and general\ncovariance in general relativity is like comparing apples and oranges.\nIt was not until 1918 that a German high school teacher by the name of Erich\nKretschmann set Einstein straight on this score (Stachel et al., Vol. 7, Doc. 4; Goenner et\nal., 431–462). This was a few years after Einstein had finally found generally-covariant\nfield equations. These equations, first published in November 1915, formed the capstone\nof his general theory of relativity. For more than two years prior to that, Einstein had used\nfield equations that are not generally covariant. He had even found a fallacious but\nultimately profound argument purporting to show that the field equations for the metric\nfield cannot be generally covariant. For reasons that need not concern us here the\nargument is known as the “hole argument” (Howard and Stachel, 63–100; Earman, ch. 9).\nThe problem with generally-covariant field equations, according to the hole argument, is\nthat they allow one and the same source to produce what look like different metric fields,\nwhereas the job of field equations is to determine uniquely what field is produced by a\ngiven source.\n16\nThe escape from the hole argument is that on closer examination the different fields\ncompatible with the same source turn out to be identical. The hole argument rests on the\nassumption that space-time points can be individuated and identified before any of their\nspatio-temporal properties are specified. Reject this assumption and the argument loses\nits force. The allegedly different metric fields only differ in that different featureless\npoints take on the identity of the same space-time points. If space-time points cannot be\nindividuated and identified independently of their spatio-temporal properties, this is no\ndifference at all.\nThis comeback to the hole argument—a popular gloss on Einstein’s so-called “point-\ncoincidence argument” (Goenner et al., 463–500)—amounts to a strong argument against\nthe view that space-time is a substance, a container for the contents of space-time. The\ncomeback shows that there are many ways to map spatio-temporal properties onto\nfeatureless points, all indistinguishable from one another. According to Leibniz’s\nPrinciple of the Identity of Indiscernibles all these indistinguishable ways must be\nphysically identical. But then these points cannot be physically real for that would make\nthe indistinguishable ways of ascribing properties to them physically distinct.\nThe combination of the hole argument and the point coincidence argument is thus\nseen to be a variant of an argument due to Leibniz himself against the Newtonian view\nthat space is a substance (Alexander). If space were a container, one version of the\nargument goes, God could have placed its contents a few feet to the left of where He\nactually placed it. But according to the Principle of the Identity of Indiscernibles these\ntwo possible universes are identical and that leaves no room for the container, which\ncould serve to distinguish the two. Einstein’s fallacious argument against general\ncovariance thus turned into an argument in support of a Leibnizian relational ontology of\nspace-time.\nDuring the period that Einstein accepted that the field equations of his theory were\nnot generally covariant, he explored yet another strategy for eliminating absolute motion.\nThis strategy was inspired by his reading of Mach’s response to Newton’s famous bucket\nexperiment. Set a bucket filled with water spinning. It will take the water some time to\ncatch up with the rotation of the bucket. Just after the bucket starts rotating, the water will\nstill be at rest and its surface will be flat. Once the water starts rotating, the water will\n17\nclimb up the sides of the bucket and its surface will become concave. Newton pointed out\nthat this effect cannot be due to the relative rotation of the water with respect to the\nbucket. After all, the effect increases as the relative rotation decreases and is at its\nmaximum when there is no relative motion at all because the water is rotating with the\nsame angular velocity as the bucket. Newton concluded that the water surface becomes\nconcave because of the water’s rotation with respect to absolute space. Mach pointed out\nthat there is another possibility: the effect could be due to the relative rotation of the\nwater with respect to all other matter in the universe. Picture the earth, the bucket, and the\nwater at the center of a giant spherical shell representing all other matter in the universe.\nIf Mach were right, it would make no difference whether the bucket or the shell is set\nrotating: in both cases the water surface should become concave. According to Newton’s\ntheory, however, the rotating shell will have no effect whatsoever on the shape of the\nwater surface.\nIn 1913–1914, Einstein was convinced for a while that this was a problem not for\nMach’s analysis but for Newton’s theory and that his own theory vindicated Mach’s\naccount of the bucket experiment. It only takes a cursory look at Einstein’s calculations\nin support of this claim to see that this attempt to relativize rotation is a non-starter. When\nEinstein calculated the metric field of a rotating shell at its center, he considered a shell\nrotating in Minkowski space-time. The rotating shell does produce a tiny deviation from\nthe metric field of Minkowski space-time, but nothing on the order needed to make the\nwater surface concave. What Einstein would have had to show to vindicate Mach is that\nthe metric field produced by the rotating shell near its center mimics Minkowski space-\ntime as seen from a rotating frame of reference. In that case the situation of the bucket at\nrest in this metric field would have been identical to that of the bucket rotating in the\nopposite direction in Minkowski space-time. But in order to calculate the metric field of a\nrotating shell, one needs to make some assumption about boundary conditions, i.e., the\nvalues of the metric field as we go to spatial infinity. Rotation with respect to space-time\nrather than other matter thus creeps back in.\nEinstein’s flawed Machian account of Newton’s bucket experiment receded into the\nbackground when he finally found generally-covariant field equations for the metric field\nin November 1915. As is clear from Einstein’s first systematic exposition of the theory in\n18\n1916 (Einstein et al., 109–164), he still believed at this point that general covariance\nguarantees the relativity of arbitrary motion. The Dutch astronomer Willem de Sitter\ndisabused him of this illusion in the fall of 1916 (Stachel et al., Vol. 8, 351–357). De\nSitter pointed out that Einstein used Minkowskian boundary conditions in his calculations\nof metric fields produced by various sources (such as the rotating shell discussed above)\nand thereby retained a remnant of absolute space-time. By early 1917, Einstein had\nworked out his response to De Sitter (Einstein et al., 175–188). He eliminated the need\nfor boundary conditions at infinity simply by eliminating infinity! He proposed a model\nfor the universe that is spatially closed. He chose the simplest model of this kind, which\nis static in addition to being closed. Such a static universe would collapse as a result of\nthe gravitational attraction between its parts. Einstein therefore needed to add a term to\nhis field equations that would provide the gravitational repulsion to neutralize this\nattraction. This term involved what has become known as the cosmological constant. In\nthe late 1920s it became clear that the universe is expanding, in which case the\ngravitational attraction can be allowed to slow down the expansion and does not need to\nbe compensated by a gravitational repulsion. In the wake of these developments, Einstein\nallegedly called the cosmological constant the biggest blunder of his life. In 1917,\nhowever, he felt he needed it to get rid of boundary conditions.\nDe Sitter quickly produced an alternative cosmological model that was allowed by\nEinstein’s new field equations with cosmological term. In this De Sitter world there is no\nmatter at all. Absolute space-time thus returned with a vengeance. In reaction to De\nSitter’s model, Einstein formulated what would come to be known as Mach’s principle\n(Stachel et al., Vol. 7, Doc. 4): the metric field is fully determined by matter and cannot\nexist without it. Einstein was convinced at this point that the addition of the cosmological\nterm guaranteed that general relativity satisfies this principle, despite the apparent\ncounter-example provided by the De Sitter solution. Early in 1918, Einstein argued that\nthe De Sitter world was not empty after all, but that hidden from view a vast amount of\nmatter was tucked away in it. He concluded that general relativity satisfies Mach’s\nprinciple and that this finally established complete relativity of arbitrary motion. All\nmotion in general relativity is motion with respect to the metric field. But if the metric\nfield can be reduced to matter, talk about such motion can be reinterpreted as a façon de\n19\nparler about motion with respect to the matter generating the metric field. This certainly\nwas a clever idea on Einstein’s part, but by June 1918 it had become clear that the De\nSitter world does not contain any hidden masses and is thus a genuine counter-example to\nMach’s principle. Another one of Einstein’s attempts to relativize all motion had failed.\nEinstein thereupon lost his enthusiasm for Mach’s principle. He accepted that motion\nwith respect to the metric field can not always be translated into motion with respect to\nother matter. He also realized that motion with respect to the metric field or curved space-\ntime is much more palatable than motion with respect to Newton’s absolute space or\nMinkowski’s absolute space-time anyway. The curved space-time of general relativity,\nunlike absolute space(-time), is a bona fide physical entity. It not only acts upon matter,\nlike absolute space(-time), by telling matter how to move, but is also acted upon, as\nmatter tells it how to curve (to borrow two slogans from Misner et al., 5). In his lectures\nin Princeton in May 1921, Einstein reformulated his objection against absolute space(-\ntime) accordingly: it is something that acts but is not acted upon (Einstein 1956, 99–108).\nEinstein had a deeper reason to abandon Mach’s principle. It was predicated on an\nantiquated 19th-century billiard-ball ontology. Einstein thought of matter as consisting of\nelectromagnetic fields, in combination perhaps with gravitational fields (Einstein et al.,\n190–198). Mach’s principle would thus amount to reducing one field to another. As can\nbe inferred from a lecture delivered in Leyden in October 1920 (Einstein 1983, 1–24),\nEinstein came to accept that the metric field exists on a par with the electromagnetic\nfield. Just as he had unified the electric and the magnetic field in special relativity and\nspace-time and gravity in general relativity, he now embarked on the quest for a theory\nunifying the electromagnetic and the inertio-gravitational field. He would spend the rest\nof his life looking for such a theory.\nEinstein’s struggle to relativize all motion, uniform and non-uniform, illustrates the\nold travelers saying that the journey is more important than the destination. Although\nEinstein never reached the destination he originally had in mind, he found many valuable\nresults along the way. For starters, he fulfilled many of his philosophical hopes, albeit in\nways very different from what he originally envisioned. Absolute motion survives in\ngeneral relativity since there is an absolute difference between moving on a geodesics\nand moving on a non-geodesic. But motion with respect to curved space-time with a\n20\ngeometry described by a field interacting with matter (itself described by other fields) is a\nmuch more agreeable proposition than motion with respect to the absolute space(-time) of\nNewtonian theory and special relativity. The combination of the hole argument and the\npoint-coincidence argument, moreover, had provided a strong argument against a\nNewtonian substantival view of space-time and strong support for the rival Leibnizian\nrelational view.\nMore importantly, Einstein had found a new theory of gravity, which does away with\nthe artificial split between space-time and gravity of Newtonian theory. This theory\nopened up such exciting research areas as modern cosmology, black holes, singularities,\ngravitational waves, and gravitational lensing. Even some of the dead ends in Einstein’s\ncrusade against absolute motion led to interesting physics. As these lines are written\nNASA’s Gravity Probe B is trying to detect frame dragging, a phenomenon first\ninvestigated in the context of Einstein’s misguided attempt to vindicate Mach’s account\nof Newton’s bucket experiment. The cosmological constant, originally introduced in the\ncontext of Einstein’s ill-fated attempt to make general relativity satisfy Mach’s principle,\nhas made a spectacular comeback in modern cosmology as a straightforward\nphenomenological description of the repulsion driving the acceleration of the expansion\nof our universe discovered in recent years through Type Ia Supernovae observations.\nEinstein’s quest for general relativity was a very rewarding journey indeed.\nBibliography\nAlexander, H. G., ed. The Leibniz-Clarke Correspondence. Manchester: Manchester University Press,\n1956.\nBarbour, Julian, and Herbert Pfister, eds. Mach’s Principle. From Newton’s Bucket to Quantum Gravity.\nBoston: Birkhäuser, 1995.\nDorling, Jon. “Did Einstein Need General Relativity to Solve the Problem of Absolute Space? Or Had the\nProblem Already Been Solved by Special Relativity?” British Journal for the Philosophy of Science 29\n(1978): 311–323.\nEarman, John. World Enough and Space-Time. Absolute versus Relational Theories of Space and Time.\nCambridge, MA: MIT Press, 1989.\nEinstein, Albert. Ideas and Opinions. New York: Crown Publishers, 1954.\n———. The Meaning of Relativity. Princeton: Princeton University Press, 1956.\n———. Relativity. The Special and the General Theory. New York: Bonanza, 1961.\n———. Sidelights on Relativity. New York: Dover, 1983.\nEinstein, Albert, et al. The Principle of Relativity. New York: Dover, 1952.\n21\nGoenner, Hubert, et al., eds. The Expanding Worlds of General Relativity. Boston: Birkhäuser, 1999.\nHoward, Don, and John Stachel, eds. Einstein and the History of General Relativity. Boston: Birkhäuser,\n1989.\nJanssen, Michel. “Reconsidering a Scientific Revolution: The Case of Einstein versus Lorentz.” Physics in\nPerspective 4 (2002): 421–446.\n———. “COI Stories: Explanation and Evidence in the History of Science.” Perspectives on Science 10\n(2002): 457–522.\nJanssen, Michel, and John Stachel. “Optics and Electrodynamics in Moving Bodies.” In Going Critical.\nJohn Stachel. Dordrecht: Kluwer, in preparation.\nMisner, Charles W., Kip S. Thorne, and John Archibald Wheeler. Gravitation. San Francisco: Freeman,\n1973.\nNiven, W. D., ed. The Scientific Papers of James Clerk Maxwell. 2 Volumes. Cambridge: Cambridge\nUniversity Press, 1890.\nNorton, John. “Geometries in Collision: Einstein, Klein, and Riemann.” In The Symbolic Universe.\nGeometry and Physics 1890–1930. Edited by Jeremy Gray. Oxford: Oxford University Press, 1999.\nPais, Abraham . ‘Subtle is the Lord…’: The Science and the Life of Albert Einstein. Oxford: Oxford\nUniversity Press, 1982.\nRenn, Jürgen, et al. The Genesis of General Relativity: Documents and Interpretation. Vol. 1. General\nRelativity in the Making: Einstein’s Zurich Notebook. 2 Volumes. Dordrecht: Kluwer, in preparation.\nRynasiewicz, Robert. “The Construction of the Special Theory: Some Queries and Considerations.” In\nEinstein: The Formative Years, 1879-1909. Edited by Don Howard and John Stachel. Boston:\nBirkhäuser, 2000.\nStachel, John, ed. Einstein’s Miraculous Year: Five Papers that Changed the Face of Physics. Princeton:\nPrinceton University Press, 1998.\nStachel, John, et al., eds. The Collected Papers of Albert Einstein. Vols. 1–8. Princeton: Princeton\nUniversity Press, 1987–2002.\n",
    "identifiers": [
      "oai:philsci-archive.pitt.edu:1733",
      null
    ],
    "language": {
      "code": "en",
      "id": 9,
      "name": "English"
    },
    "relations": [
      "http://philsci-archive.pitt.edu/1733/"
    ],
    "repositories": [
      {
        "id": "425",
        "openDoarId": 0,
        "name": "PhilSci Archive",
        "uri": null,
        "uriJournals": null,
        "physicalName": "noname",
        "source": null,
        "software": null,
        "metadataFormat": null,
        "description": null,
        "journal": null,
        "pdfStatus": null,
        "nrUpdates": 0,
        "disabled": false,
        "lastUpdateTime": null,
        "metadataRecordCount": 0,
        "metadataDeletedRecordCount": 0,
        "metadataLinkCount": 0,
        "metadataSize": 0,
        "journalMetadataSize": 0,
        "metadataAge": null,
        "journalMetadataAge": null,
        "metadataInIndexCount": 0,
        "metadataDeletedInIndexCount": 0,
        "metadataAlloweInIndexCount": 0,
        "metadataDisabledInIndexCount": 0,
        "metadataExtractionDate": null,
        "journalMetadataExtractionDate": null,
        "databaseRecordCount": 0,
        "databaseDeletedRecordCount": 0,
        "databasePdfLinkCount": 0,
        "databasePdfCount": 0,
        "databaseDeletedPdfCount": 0,
        "hardDrivePdfSize": 0,
        "hardDrivePdfCount": 0,
        "hardDriveDeletedPdfCount": 0,
        "databaseTextCount": 0,
        "databaseTextNotDeletedCount": 0,
        "hardDriveTextCount": 0,
        "hardDriveDeletedTextCount": 0,
        "databaseIndexCount": 0,
        "indexRecordCount": 0,
        "indexJournalCount": 0,
        "indexTextCount": 0,
        "metadataOnlyIndex": 0,
        "indexTextCountDB": 0,
        "indexedPdfDB": 0,
        "indexedDisabledDB": 0,
        "indexTextNotDeletedCount": 0,
        "hardDriveCitationFiles": 0,
        "citationFilesDb": 0,
        "crawlingLimit": 0,
        "citationCount": 0,
        "citationWithDocCount": 0,
        "citationDoiCount": 0,
        "documentDoiCount": 0,
        "documentDoiWithFulltextCount": 0,
        "repositoryLocation": null
      }
    ],
    "subjects": [
      "Preprint",
      "NonPeerReviewed"
    ],
    "title": "Relativity",
    "topics": [
      "Relativity Theory"
    ],
    "types": [],
    "year": 2004,
    "fulltextUrls": [
      "https://core.ac.uk/download/pdf/11920832.pdf",
      "https://core.ac.uk/display/11920832",
      "http://philsci-archive.pitt.edu/1733/1/RelativityDHI.pdf",
      "http://philsci-archive.pitt.edu/1733/"
    ],
    "fulltextIdentifier": "https://core.ac.uk/download/pdf/11920832.pdf",
    "oai": "oai:philsci-archive.pitt.edu:1733"
  }
}
