{
   "totalfound": "3",
   "totalsearched": "4167294",
   "document": [
      {
         "rank": "1",
         "title": "2D and 3D visualizations",
         "authors": "John Smith; Robert Williams; Steven Martin",
         "affiliations": "Department of Computer Science, Riceton, Canada",
         "controlledterms": [
            "Internet",
            "data visualisation",
            "search engines",
            "virtual reality"
         ],
         "thesaurusterms": [
            "Collaboration",
            "Data visualization",
            "Software",
            "Three dimensional displays",
            "Visualization"
         ],
         "pubtitle": "2010 IEEE International Conference on Software Visualizations",
         "punumber": "5604771",
         "pubtype": "Conference Publications",
         "publisher": "IEEE",
         "py": "2010",
         "spage": "1",
         "epage": "5",
         "abstract": "Several types of 3D software visualizations have been developed to communicate information about the products of a software project and, sometimes, the development process itself. These visualizations have been limited in the degree of interactivity they enabled (primarily panning and zooming) and in their accessibility (since in most cases they assumed a particular client platform). In this paper we discuss our 3D visualization of the data collected and extracted in our collaborative software-development platform WikiDev2.0, developed in the Open Wonderland virtual world. The visualization adopts a city metaphor, similar to earlier work, but advances the state of the art by providing a web-accessible distributed 3D environment where multiple users can explore the same project. In this paper we discuss this visualization, which we call WikiDev3D, and we report on our preliminary findings about its effectiveness against the more traditional visualization of the original WikiDev2.0 tool.",
         "issn": "1063-6773",
         "isbn": "New-2005_Electronic_978-1-4244-8629-8",
         "htmlFlag": "1",
         "arnumber": "5609696",
         "doi": "10.1109/ICSM.2010.5609696",
         "publicationId": "5609696",
         "partnum": "5609696",
         "mdurl": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&amp;arnumber=5609696&amp;contentType=Conference+Publications",
         "pdf": "http://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=5609696"
      },
      {
         "rank": "2",
         "title": "Real-time traffic-based routing, based on open data and open-source software",
         "authors": "Diego Serrano; John Smith; Teresa Baldassarre; Eleni Stroulia",
         "affiliations": "University of Alberta, Edmonton, Canada",
         "thesaurusterms": [
            "Cloud computing",
            "Computer architecture",
            "Distributed databases",
            "Real-time systems",
            "Roads",
            "Smart cities"
         ],
         "pubtitle": "2016 IEEE 3rd World Forum on Internet of Things (WF-IoT)",
         "punumber": "7831562",
         "pubtype": "Conference Publications",
         "publisher": "IEEE",
         "py": "2016",
         "spage": "661",
         "epage": "665",
         "abstract": "The emergence of cloud computing and the Internet of Things (IoT) have given rise to a wealth of new opportunities for integrating heterogeneous systems and collecting massive data sets, whose analysis may lead to new information, insight, and knowledge. Building a scalable architecture for urban IoT environments is a complex task, primarily because of the massive amounts of data generated by sensor devices, and the variety of data sources. And yet it is a compelling application area, given the number of potential municipal services that can be improved using these technologies. In this paper, we describe our study of how cloud-computing and big-data management technologies can assist decision making for transportation systems in smart cities. More specifically, this paper presents and discusses a proof-of-concept prototype, based on open-source technologies and publicly available data for the city of Edmonton.",
         "isbn": "New-2005_Electronic_978-1-5090-4130-5",
         "arnumber": "7845419",
         "doi": "10.1109/WF-IoT.2016.7845419",
         "publicationId": "7845419",
         "partnum": "7845419",
         "mdurl": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&amp;arnumber=7845419&amp;contentType=Conference+Publications",
         "pdf": "http://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=7845419"
      }
   ]
}
